In [1]:
import pandas as pd

In [2]:
pd.Series([10, 8, 7, 9])

0    10
1     8
2     7
3     9
dtype: int64

In [3]:
notas = pd.Series([10, 8, 7, 9])

In [4]:
notas.mean()

8.5

In [5]:
notas.sum()

34

In [6]:
notas.std()

1.2909944487358056

In [7]:
df = pd.DataFrame({
    'aluno': ['Felicty', 'Arrow', 'Berry', 'Capitão America', 'Thor'],
    'faltas': [1, 8, 4, 0, 2],
    'prova': [10, 9.8, 4.5, 8.5, 7.8]
})

In [8]:
df

             aluno  faltas  prova
0          Felicty       1   10.0
1            Arrow       8    9.8
2            Berry       4    4.5
3  Capitão America       0    8.5
4             Thor       2    7.8

In [9]:
df.iloc[0]

aluno     Felicty
faltas          1
prova        10.0
Name: 0, dtype: object

In [10]:
df.columns

Index(['aluno', 'faltas', 'prova'], dtype='object')

In [12]:
df.dtypes

aluno      object
faltas      int64
prova     float64
dtype: object

In [14]:
df[df["prova"] > 8]

             aluno  faltas  prova
0          Felicty       1   10.0
1            Arrow       8    9.8
3  Capitão America       0    8.5

In [15]:
apple = pd.read_csv('D:\\WorkSpace\\Github\\ETL_na_Pratica_como_Trabalhar_com_Dados_Online\\Aula_04_Extraindo_Dados\\Arquivos\\AAPL.csv', sep=',')

In [16]:
apple

,Date,Open,High,Low,Close,Adj Close,Volume
0,2018-07-18,191.779999,191.800003,189.929993,190.399994,187.545181,16393400
1,2018-07-19,189.690002,192.550003,189.690002,191.880005,189.003006,20286800
2,2018-07-20,191.779999,192.429993,190.169998,191.440002,188.569595,20676200
3,2018-07-23,190.679993,191.960007,189.559998,191.610001,188.737030,15989400
4,2018-07-24,192.449997,193.660004,192.050003,193.000000,190.106216,18697900
...,...,...,...,...,...,...,...
247,2019-07-12,202.449997,204.000000,202.199997,203.300003,203.300003,17595200
248,2019-07-15,204.089996,205.869995,204.000000,205.210007,205.210007,16947400
249,2019-07-16,204.589996,206.110001,203.500000,204.500000,204.500000,16866800
250,2019-07-17,204.050003,205.089996,203.270004,203.350006,203.350006,14088300
251,2019-07-18,204.000000,205.880005,203.699997,205.660004,205.660004,15724494

In [17]:
apple.head(5)

,Date,Open,High,Low,Close,Adj Close,Volume
0,2018-07-18,191.779999,191.800003,189.929993,190.399994,187.545181,16393400
1,2018-07-19,189.690002,192.550003,189.690002,191.880005,189.003006,20286800
2,2018-07-20,191.779999,192.429993,190.169998,191.440002,188.569595,20676200
3,2018-07-23,190.679993,191.960007,189.559998,191.610001,188.737030,15989400
4,2018-07-24,192.449997,193.660004,192.050003,193.000000,190.106216,18697900

In [18]:
apple.tail(5)

,Date,Open,High,Low,Close,Adj Close,Volume
247,2019-07-12,202.449997,204.000000,202.199997,203.300003,203.300003,17595200
248,2019-07-15,204.089996,205.869995,204.000000,205.210007,205.210007,16947400
249,2019-07-16,204.589996,206.110001,203.500000,204.500000,204.500000,16866800
250,2019-07-17,204.050003,205.089996,203.270004,203.350006,203.350006,14088300
251,2019-07-18,204.000000,205.880005,203.699997,205.660004,205.660004,15724494

In [19]:
apple.tail(7)["Adj Close"].mean()

<bound method Series.mean of 245    203.229996
246    201.750000
247    203.300003
248    205.210007
249    204.500000
250    203.350006
251    205.660004
Name: Adj Close, dtype: float64>

In [20]:
apple.tail(7)[["Adj Close"]].mean()

Adj Close    203.857145
dtype: float64

In [21]:
apple.describe()

,Open,High,Low,Close,Adj Close,Volume
count,252.000000,252.000000,252.000000,252.000000,252.000000,2.520000e+02
mean,192.479325,194.480715,190.559603,192.580437,191.239701,3.250815e+07
std,21.630732,21.758249,21.569369,21.644905,21.217154,1.387518e+07
min,143.979996,145.720001,142.000000,142.190002,141.039642,1.136200e+07
25%,174.872501,175.967499,173.747501,174.832496,174.111996,2.308030e+07
50%,194.279999,196.165001,192.599998,194.180000,193.582848,2.942395e+07
75%,209.312500,210.074997,206.832497,208.872498,206.713852,3.876472e+07
max,230.779999,233.470001,229.779999,232.070007,229.392090,9.624670e+07